/*Напишете алгоритъм, който да помогне на любимият ви учител да оцени домашните по математика. 
Алгоритъмът трябва по дадени равенства (състоящи се от математически изрази, разделени със знаци
 за равенство) да даде оценка на коректността на равенството.
Hint: str.split("=")
Примери:
"3 + 2 = 5" => "1 / 1"
Има само една стъпка и тя е изпълнена правилно.
"7 - 3 * 2 + 1 = 4 * 2 + 1 = 8 + 1 = 9" => "2 / 3"
Първата стъпка е грешна, но следващите 2 са, поради тази причина пишен 2 от 3 точки.
Допускаме, че операндите са винаги с по 1 цифра.*/

function getMark(str) {
  let arr = str.split("=").map((x) => eval(x));
  let highest = arr.length - 1;
  let curr = highest;

  for (let i = 0; i < arr.length - 1; i++) {
    if (arr[i] !== arr[i + 1]) {
      curr--;
    }
  }

  return [curr, highest];
}

var task = " 7 - 3 * 2 + 1 = 4 * 2 + 1 = 8 + 1 = 9";
var marks = getMark(task);
console.log(marks[0] + "/" + marks[1]);
